pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_bootloader_specification_semantics.cpp
    outArgument_outListFileContents.dotAssign_operation (enumerator_5104.current_mRoutineName (HERE).reader_string (SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 98)).reader_stringByLeftPadding (GALGAS_uint ((uint32_t) 40U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 98)).operator_concat (GALGAS_string (" ")  COMMA_SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 98)).operator_concat (var_entryPointAddress.reader_hexString (SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 98))  COMMA_SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 98)).operator_concat (GALGAS_string ("\n")  COMMA_SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 98))  COMMA_SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 98)) ;
    var_entryPointAddress = var_entryPointAddress.add_operation (GALGAS_uint ((uint32_t) 4U), inCompiler COMMA_SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 99)) ;
    enumerator_5104.gotoNextObject () ;
  }
  outArgument_outListFileContents.dotAssign_operation (GALGAS_string ("\n")  COMMA_SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 101)) ;
  outArgument_outRegisterTable = outArgument_outPiccoloDeviceModel.reader_mRegisterTable (SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 103)) ;
  {
  GALGAS_declaredByteMap joker_5820_0 ; // Joker input parameter
  routine_analyze_5F_ram_5F_sections (GALGAS_string ("SHARED VARIABLES"), constinArgument_inSharedRamDefinitionList, outArgument_outRamBank, outArgument_outPiccoloDeviceModel.reader_mRegisterTable (SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 108)), outArgument_outListFileContents, outArgument_outRegisterTable, joker_5820_0, inCompiler  COMMA_SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 104)) ;
  }
  outArgument_outListFileContents.dotAssign_operation (GALGAS_string::makeEmptyString ().reader_stringByLeftAndRightPadding (GALGAS_uint ((uint32_t) 79U), GALGAS_char (TO_UNICODE (42)) COMMA_SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 113)).operator_concat (GALGAS_string ("\n"
    "\n")  COMMA_SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 113))  COMMA_SOURCE_FILE ("pic18_bootloader_specification_semantics.gSemantics", 113)) ;
}


//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


